app/controllers/api/v1/customer_controller.rb

SELECT "items".* FROM "items"CustomerDevLog:   ↳ app/controllers/api/v1/customer_controller.rb:22:in `indexCustomer'CustomerDevLog:   Group Load (1.4ms)  SELECT "groups".* FROM "groups"CustomerDevLog:   ↳ app/controllers/api/v1/customer_controller.rb:22:in `indexCustomer'CustomerDevLog: Completed 200 OK in 235ms (Views: 18.2ms | ActiveRecord: 18.6ms | Allocations: 11635)
---
  def indexCustomer
    customerSql = "select customers.id as customer_id, items.id as order_id, groups.id as group_id,
    customers.name, customers.age, customers.email, customers.address, items.name as item_name,
    groups.name as group_name, customers.order_date, customers.remark
    from customers, items, groups where customers.order_id=items.id and
    customers.group_id=groups.id";
    @customers = ActiveRecord::Base.connection.execute(customerSql)
    @items = Item.all